Repository: CyrilleB79/AI-content-describer
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: fr

source: There appears to be an older version of this add-on installed that is incompatable with future versions because the name has changed. It will be removed the next time NVDA is restarted.
fr: Il semble y avoir une ancienne version de ce module complémentaire installée qui est incompatible avec les versions futures car le nom a changé. Il sera supprimé au prochain redémarrage de NVDA.

source: AI Content Describer
fr: Descripteur de contenu IA

source: Manage &models
fr: Gérer les &modèles

source: Model (configure more in the manage models dialog, defaults to last used):
fr: Modèle (configurez davantage dans la boîte de dialogue de gestion des modèles, la valeur par défaut est la dernière utilisée) :

source: Open each result in a browseable dialog; Markdown will be rendered if possible
fr: Ouvrez chaque résultat dans une boîte de dialogue consultable ; Markdown sera rendu si possible

source: Remember/cache descriptions of each item to save API quota
fr: Mémoriser/mettre en cache les descriptions de chaque élément pour enregistrer le quota API

source: Optimize images for size, may speed up detection in some situations (experimental)
fr: Optimiser la taille des images, peut accélérer la détection dans certaines situations (expérimental)

source: Current focus
fr: Focus actuel

source: Navigator object
fr: Objet Navigateur

source: Entire screen
fr: Écran entier

source: Take a picture
fr: Prendre une photo

source: Detect face position
fr: Détecter la position du visage

source: Select camera
fr: Sélectionnez la caméra

source: Release the camera to make it usable by other applications
fr: Relâchez la caméra pour la rendre utilisable par d'autres applications

source: Face Detection (no API required)
fr: Détection de visage (aucune API requise)

source: Model
fr: Modèle

source: Please disable windows screen curtain before using AI content describer.
fr: Veuillez désactiver le rideau d'écran Windows avant d'utiliser le descripteur de contenu IA.

source: Content is not visible
fr: Le contenu n'est pas visible

source: Could not snap an image of the requested object
fr: Impossible de prendre une image de l'objet demandé

source: Error initializing the face detection interface. Please consult the NVDA log for more information.
fr: Erreur lors de l'initialisation de l'interface de détection de visage. Veuillez consulter le journal NVDA pour plus d'informations.

source: Face detection interface is loading. Please try this command again after a couple seconds.
fr: L'interface de détection de visage est en cours de chargement. Veuillez réessayer cette commande après quelques secondes.

source: Could not get window content
fr: Impossible d'obtenir le contenu de la fenêtre

source: The picture could not be taken. Please ensure that your camera is not in use by another application and try again.
fr: La photo n'a pas pu être prise. Veuillez vous assurer que votre caméra n'est pas utilisée par une autre application et réessayez.

source: The picture could not be saved.
fr: L'image n'a pas pu être enregistrée.

source: The item on the clipboard is not an image.
fr: L'élément dans le presse-papiers n'est pas une image.

source: Unsupported image format. Please copy another file to the clipboard that is {''.join(service.supported_formats)}
fr: Format d'image non pris en charge. Veuillez copier un autre fichier dans le presse-papiers : {''.join(service.supported_formats)}

source: To describe content, you must provide an API key or base URL in the AI image describer category of the NVDA settings dialog. Please consult add-on help for more information
fr: Pour décrire le contenu, vous devez fournir une clé API ou une URL de base dans la catégorie descripteur d'image AI de la boîte de dialogue des paramètres NVDA. Veuillez consulter l'aide du module complémentaire pour plus d'informations.

source: To describe content, you must define a prompt by navigating to the AI image describer category of the NVDA settings dialog. Please consult add-on help for more information
fr: Pour décrire le contenu, vous devez définir une invite en accédant à la catégorie descripteur d'image AI de la boîte de dialogue des paramètres NVDA. Veuillez consulter l'aide du module complémentaire pour plus d'informations.

source: Retrieving description using {service.name}...
fr: Récupération de la description à l'aide de {service.name}...

source: Image description
fr: description de l'image

source: Success
fr: Succès

source: Describe the image (or file path to an image) on the clipboard using AI.
fr: Décrivez l'image (ou le chemin d'accès à une image) dans le presse-papiers à l'aide de l'IA.

source: Describe the contents of the current navigator object using AI.
fr: Décrivez le contenu de l'objet navigateur actuel à l'aide de l'IA.

source: Describe the contents of the currently focused item using AI.
fr: Décrivez le contenu de l'élément actuellement ciblé à l'aide de l'IA.

source: Take a screenshot, then describe it using AI.
fr: Prenez une capture d'écran, puis décrivez-la à l'aide de l'IA.

source: Pop up a menu asking whether to describe the current focus, navigator object, or entire screen with AI.
fr: Un menu contextuel vous demande s'il faut décrire le focus actuel, l'objet de navigation ou l'écran entier avec l'IA.

source: Snap a picture using the selected camera, then describe it using AI.
fr: Prenez une photo à l'aide de l'appareil photo sélectionné, puis décrivez-la à l'aide de l'IA.

source: Describe the position of the face in the frame using the selected camera, if applicable.
fr: Décrivez la position du visage dans le cadre à l'aide de la caméra sélectionnée, le cas échéant.

source: Some of the dependencies required for this NVDA add-on to run are not available on your computer. Would you like to download them now? NVDA will need to be restarted when this process completes.
fr: Certaines des dépendances requises pour l'exécution de ce module complémentaire NVDA ne sont pas disponibles sur votre ordinateur. Souhaitez-vous les télécharger maintenant ? NVDA devra être redémarré une fois ce processus terminé.

source: Some of the dependencies required for this NVDA add-on to run are outdated. Would you like to try to install them now? NVDA will need to be restarted when complete.
fr: Certaines des dépendances requises pour l'exécution de ce module complémentaire NVDA sont obsolètes. Souhaitez-vous essayer de les mettre à jour maintenant ? NVDA devra être redémarré une fois terminé.

source: Would you like to delete the old dependencies from the configuration? This question will be asked once. If you are running multiple versions of NVDA interchangeably, select no.
fr: Souhaitez-vous supprimer les anciennes dépendances de la configuration ? Cette question sera posée une seule fois. Si vous exécutez plusieurs versions de NVDA de manière interchangeable, sélectionnez non.

source: The dependencies have been downloaded successfully. NVDA will now restart for the changes to take affect
fr: Les dépendances ont été téléchargées avec succès. NVDA va maintenant redémarrer pour que les modifications prennent effet

source: Unfortunately, there doesn't yet seem to be dependencies available for the running version of NVDA. Please submit an issue in our bug tracker or contact the developers. In the meantime, you may wish to disable the add-on to surpress this message on startup.
fr: Malheureusement, il ne semble pas encore y avoir de dépendances disponibles pour la version en cours d'exécution de NVDA. Veuillez soumettre un problème dans notre outil de suivi des bogues ou contacter les développeurs. En attendant, vous souhaiterez peut-être désactiver le module complémentaire pour supprimer ce message au démarrage.

source: Unfortunately, there was a problem downloading the dependencies required to run this add-on. Please consult the NVDA log for more details.
fr: Malheureusement, un problème est survenu lors du téléchargement des dépendances requises pour exécuter ce module complémentaire. Veuillez consulter le journal NVDA pour plus de détails.

source: error
fr: erreur

source: error making connection
fr: erreur lors de la connexion

source: error, connection refused by target
fr: erreur, connexion refusée par la cible

source: The GPT4 model from OpenAI, previewed with vision capabilities. As of April 2024, this model has been superseded by GPT4 turbo which has consistently achieved better metrics in tasks involving visual understanding.
fr: Le modèle GPT4 d'OpenAI, présenté en avant-première avec des capacités de vision. Depuis avril 2024, ce modèle a été remplacé par le GPT4 turbo, qui a constamment obtenu de meilleures mesures dans les tâches impliquant une compréhension visuelle.

source: The next generation of the original GPT4 vision preview, with enhanced quality and understanding.
fr: La nouvelle génération de l'aperçu de vision GPT4 original, avec une qualité et une compréhension améliorées.

source: Google's Gemini model with vision capabilities.
fr: Modèle Gemini de Google avec capacités de vision.

source: Gemini encountered an error: {response['error']['code']}, {response['error']['message']}
fr: Gemini a rencontré une erreur : {response['error']['code']}, {response['error']['message']}

source: Claude encountered an error. {response['error']['message']}
fr: Claude a rencontré une erreur. {réponse['erreur']['message']}

source: Anthropic's most powerful model for highly complex tasks.
fr: Le modèle le plus puissant d'Anthropic pour les tâches très complexes.

source: Anthropic's model with Ideal balance of intelligence and speed, excels for enterprise workloads.
fr: Le modèle d'Anthropic, offrant un équilibre idéal entre intelligence et vitesse, excelle pour les charges de travail d'entreprise.

source: Anthropic's fastest and most compact model for near-instant responsiveness
fr: Le modèle Anthropic le plus rapide et le plus compact pour une réactivité quasi instantanée

source: llama.cpp is a state-of-the-art, open-source solution for running large language models locally and in the cloud. This add-on integration assumes that you have obtained llama.cpp from Github and an image capable model from Huggingface or another repository, and that a server is currently running to handle requests. Though the process for getting this working is largely a task for the user that knows what they are doing, you can find basic steps in the add-on documentation.
fr: llama.cpp est une solution open source de pointe permettant d'exécuter de grands modèles de langage localement et dans le cloud. Cette intégration complémentaire suppose que vous avez obtenu llama.cpp depuis Github et un modèle compatible avec les images depuis Huggingface ou un autre référentiel, et qu'un serveur est actuellement en cours d'exécution pour gérer les demandes. Bien que le processus pour que cela fonctionne soit en grande partie une tâche pour l'utilisateur qui sait ce qu'il fait, vous pouvez trouver les étapes de base dans la documentation du module complémentaire.

source: Image recognition response appears to be malformed. {repr(response)}
fr: La réponse de reconnaissance d’image semble mal formée. {repr(réponse)}

source: Choose a camera
fr: Choisissez une caméra

source: &Available cameras
fr: &Caméras disponibles

source: Camera selected. You may now trigger the command again.
fr: Caméra sélectionnée. Vous pouvez maintenant déclencher à nouveau la commande.

source: Failed to interface with the camera. Please ensure it is not in use by another application, then try again.
fr: Échec de l'interface avec la caméra. Veuillez vous assurer qu'il n'est pas utilisé par une autre application, puis réessayez.

source: The footage from the camera is too blurry. Try switching your focus away from the desktop, then try this command again.
fr: Les images de la caméra sont trop floues. Essayez de détourner votre attention du bureau, puis réessayez cette commande.

source: The footage from the camera is too blurry. Please ensure that it is not covered up and that your surroundings have proper lighting. {int(laplacian_variance)}
fr: Les images de la caméra sont trop floues. Veuillez vous assurer qu'il n'est pas masqué et que votre environnement est correctement éclairé. {int(laplacian_variance)}

source: No face detected. Please ensure your face is in the frame and that your camera is not covered up.
fr: Aucun visage détecté. Veuillez vous assurer que votre visage est dans le cadre et que votre appareil photo n'est pas masqué.

source: {len(faces)} faces detected near the frame. Please try for another angle with fewer background objects.
fr: {len(faces)} visages détectés à proximité du cadre. Veuillez essayer un autre angle avec moins d'objets d'arrière-plan.

source: No camera found on your system. Please connect one and try again.
fr: Aucune caméra trouvée sur votre système. Veuillez en connecter un et réessayer.

source: is no longer available. Switching to the other on the system.
fr: n'est plus disponible. Passage à l'autre sur le système.

source: Camera unavailable. Please try selecting another
fr: Caméra indisponible. Veuillez essayer d'en sélectionner un autre

source: Starting the face detection interface. This may take a few seconds. Please wait.
fr: Démarrage de l'interface de détection de visage. Cela peut prendre quelques secondes. S'il vous plaît, attendez.

source: Failed to interface with the chosen camera
fr: Échec de l'interface avec la caméra choisie

source: Model configuration
fr: Configuration du modèle

source: About this model
fr: À propos de ce modèle

source: API key
fr: Clé API

source: Base URL
fr: URL de base

source: Prompt
fr: Invite

source: Reset prompt to default
fr: Réinitialiser l'invite par défaut

source: Maximum tokens
fr: Nombre maximum de jetons

source: Seconds to wait for a response before timing out
fr: Quelques secondes pour attendre une réponse avant d'expirer

source: About model
fr: À propos du modèle

source: This add-on makes it possible to describe the focus object, navigator object, or screen using popular vision capable AI language models, like Claude, Gemini, or GPT4. It also lets one understand where their face is positioned in the frame of a connected camera. Though content descriptions are quite detailed, they may not always be completely accurate or reflect real world information. To begin with GPT, head to https://platform.openai.com/account/api-keys and create an account, then create a key for interacting with the API. See add-on documentation for more information on this. Then, choose the "AI content describer" category from NVDA's settings dialog -> manage models and enter your API key. Press NVDA+shift+i to pop up a menu asking how you wish to describe based on the current position, or NVDA+shift+u to describe the navigator object, or NVDA+shift+y for an image that has been copied to the clipboard such as in windows explorer. Other keystrokes are customizable from the input gestures dialog.
fr: Ce module complémentaire permet de décrire l'objet focal, l'objet navigateur ou l'écran à l'aide de modèles de langage d'IA populaires capables de vision, comme Claude, Gemini ou GPT4. Il permet également de comprendre où se situe un visage dans le cadre d'une caméra connectée. Bien que les descriptions de contenu soient assez détaillées, elles peuvent ne pas toujours être tout à fait exactes ou refléter des informations réelles. Pour commencer avec GPT, rendez-vous sur https://platform.openai.com/account/api-keys et créez un compte, puis créez une clé pour interagir avec l'API. Consultez la documentation du module complémentaire pour plus d’informations à ce sujet. Ensuite, choisissez la catégorie « Descripteur de contenu AI » dans la boîte de dialogue des paramètres de NVDA -> gérer les modèles et entrez votre clé API. Appuyez sur NVDA+shift+i pour faire apparaître un menu vous demandant comment vous souhaitez décrire en fonction de la position actuelle, ou NVDA+shift+u pour décrire l'objet navigateur, ou NVDA+shift+y pour une image qui a été copiée dans le presse-papiers comme dans l'explorateur Windows. D'autres raccourcis sont personnalisables à partir de la boîte de dialogue des gestes de saisie.
